{"id":"4a1c5830-1990-11ed-ad7b-31580400a77c","updated_at":"2022-08-11T16:34:34.139Z","updated_by":"elastic","created_at":"2022-08-11T16:11:43.624Z","created_by":"elastic","name":"Filebeat docker container es occurrences","tags":[],"interval":"1m","enabled":true,"description":"Detects occurrences of 'es*' docker container name in syslogs (filebeat-es container). ","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-120s","rule_id":"aa71119d-bed5-4065-9f9c-bb1447604a6c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-local-logs*"],"query":"container.name : *es*","filters":[],"throttle":"rule","actions":[{"group":"default","id":"preconfigured-alert-history-es-index","params":{"documents":["{\"@timestamp\":\"2022-08-11T16:30:08.629Z\",\"tags\":\"{{rule.tags}}\",\"rule\":{\"id\":\"{{rule.id}}\",\"name\":\"{{rule.name}}\",\"params\":{\"{{rule__type}}\":\"{{params}}\"},\"space\":\"{{rule.spaceId}}\",\"type\":\"{{rule.type}}\"},\"kibana\":{\"alert\":{\"id\":\"{{alert.id}}\",\"context\":{\"{{rule__type}}\":\"{{context}}\"},\"actionGroup\":\"{{alert.actionGroup}}\",\"actionGroupName\":\"{{alert.actionGroupName}}\"}},\"event\":{\"kind\":\"alert\"}}"],"indexOverride":"kibana-alert-history-es"},"action_type_id":".index"}]}
{"id":"0224c570-1991-11ed-ad7b-31580400a77c","updated_at":"2022-08-11T16:16:51.953Z","updated_by":"elastic","created_at":"2022-08-11T16:16:51.953Z","created_by":"elastic","name":"Host machine sudo occurrences","tags":[],"interval":"1m","enabled":true,"description":"Detects occurrences of the use of 'sudo' in host machine.","risk_score":73,"severity":"high","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-120s","rule_id":"38ce8585-324c-4fdb-b8c3-55d2d03ef4b4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["*logstash-host-syslog*"],"query":"syslog_program : sudo","filters":[],"throttle":"rule","actions":[{"group":"default","id":"preconfigured-alert-history-es-index","params":{"documents":["{\"@timestamp\":\"2022-08-11T15:58:51.805Z\",\"tags\":\"{{rule.tags}}\",\"rule\":{\"id\":\"{{rule.id}}\",\"name\":\"{{rule.name}}\",\"params\":{\"{{rule__type}}\":\"{{params}}\"},\"space\":\"{{rule.spaceId}}\",\"type\":\"{{rule.type}}\"},\"kibana\":{\"alert\":{\"id\":\"{{alert.id}}\",\"context\":{\"{{rule__type}}\":\"{{context}}\"},\"actionGroup\":\"{{alert.actionGroup}}\",\"actionGroupName\":\"{{alert.actionGroupName}}\"}},\"event\":{\"kind\":\"alert\"}}"],"indexOverride":"kibana-alert-history-sudo"},"action_type_id":".index"}]}
{"id":"73927b60-1993-11ed-ad7b-31580400a77c","updated_at":"2022-08-11T16:34:21.131Z","updated_by":"elastic","created_at":"2022-08-11T16:34:21.131Z","created_by":"elastic","name":"Filebeat docker container kernel occurrences","tags":[],"interval":"1m","enabled":true,"description":"Detects occurrences of 'kernel*' in syslogs 'message' field (filebeat-es container). ","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-120s","rule_id":"4953997f-9cd1-425a-ad1c-6c23e3127cf1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["filebeat-local-log*"],"query":"message : kernel*","filters":[],"throttle":"rule","actions":[{"group":"default","id":"preconfigured-alert-history-es-index","params":{"documents":["{\"@timestamp\":\"2022-08-11T15:58:51.805Z\",\"tags\":\"{{rule.tags}}\",\"rule\":{\"id\":\"{{rule.id}}\",\"name\":\"{{rule.name}}\",\"params\":{\"{{rule__type}}\":\"{{params}}\"},\"space\":\"{{rule.spaceId}}\",\"type\":\"{{rule.type}}\"},\"kibana\":{\"alert\":{\"id\":\"{{alert.id}}\",\"context\":{\"{{rule__type}}\":\"{{context}}\"},\"actionGroup\":\"{{alert.actionGroup}}\",\"actionGroupName\":\"{{alert.actionGroupName}}\"}},\"event\":{\"kind\":\"alert\"}}"],"indexOverride":"kibana-alert-history-kernel"},"action_type_id":".index"}]}
{"exported_count":3,"exported_rules_count":3,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
